Repository: aws-samples/amazon-pinpoint-interactive-sms-multilingual
Catalog: receive_sms_messages/locales/*/LC_MESSAGES/*.po
Languages: es, vi

# VERIFY_ADDRESS_PROMPT
source: Thank you. Please verify you are %FIRST_NAME% %LAST_NAME% by providing your date of birth (MM/DD/YYYY).
es: Gracias. Verifica que eres %FIRST_NAME% %LAST_NAME% proporcionando tu fecha de nacimiento (MM/DD/YYYY).
vi: Cám ơn anh. Vui lòng xác minh bạn là %FIRST_NAME% %LAST_NAME% bằng cách cung cấp ngày sinh của bạn (MM/DD/YYYY).

# VERIFY_ADDRESS_PROMPT_DECLINED
source: Thank you. You can restart the process at any time by replying UPDATE or visiting https://example.gov/medicaid/.
es: Gracias. Puede reiniciar el proceso de actualización de la dirección mediante la respuesta UPDATE.
vi: Cám ơn anh. Bạn có thể khởi động lại quá trình cập nhật địa chỉ bằng cách trả lời UPDATE.

# OPTED_OUT
source: You have opted out. You will no longer receive messages. You can update your address any time by visiting https://example.gov/medicaid/.
es: Has optado por no salir. Ya no recibirás mensajes. Llame al 555-123-4567 para actualizar su dirección con un agente por teléfono.
vi: Bạn đã chọn không tham gia. Bạn sẽ không còn nhận được tin nhắn. Vui lòng gọi 555-123-4567 để cập nhật địa chỉ của bạn với một đại lý qua điện thoại.

# INVALID_RESPONSE
source: Please select a valid response. YES / NO / STOP
es: Por favor, seleccione una respuesta válida. YES / NO / STOP
vi: Vui lòng chọn một phản hồi hợp lệ. YES / NO / STOP

# IDENTITY_VERIFIED
source: Thank you. Your identity has been verified.
es: Gracias. Tu identidad ha sido verificada.
vi: Cám ơn anh. Danh tính của anh đã được xác minh.

# ADDRESS_CHANGE_PROMPT
source: We have your mailing address saved as: "%PHYSICAL_ADDRESS%" If that’s right, reply YES. If that’s wrong, reply NO.
es: Su dirección actual es "%PHYSICAL_ADDRESS%". ¿Te gustaría cambiarlo? Por favor conteste YES o NO.
vi: Địa chỉ hiện tại của bạn là "%PHYSICAL_ADDRESS%”. Bạn có muốn thay đổi nó không? Vui lòng trả lời YES hoặc NO.

# FAILED_IDENTITY_VERIFICATION
source: Unable to verify identity. You can restart the process at any time by replying UPDATE or visiting https://example.gov/medicaid/.
es: No se pudo verificar la identidad. Puede reiniciar el proceso de actualización de la dirección mediante la respuesta UPDATE.
vi: Không thể xác minh danh tính. Bạn có thể khởi động lại quá trình cập nhật địa chỉ bằng cách trả lời UPDATE.

# PROMPT_FOR_ADDRESS
source: Thank you. Please reply with your updated address. You can also update your address at https://example.gov/medicaid/.
es: Gracias. Por favor responda con su dirección completa.
vi: Cám ơn anh. Vui lòng trả lời với địa chỉ đầy đủ của bạn.

# ADDRESS_CONFIRMED
source: Thank you. You should receive an address confirmation letter in 2-4 weeks. If it doesn’t arrive, or if you have questions, visit https://example.gov/medicaid/. Reply STOP to opt out.
es: Gracias. Su dirección ha sido confirmada para ser exacta.
vi: Cám ơn anh. Địa chỉ của bạn đã được xác nhận là chính xác.

# CONFIRM_ADDRESS_PROMPT
source: Thank you. Your address is: %MESSAGE_BODY% Is this correct? Please reply YES or NO.
es: Gracias. Tu dirección es “%MESSAGE_BODY%”. ¿Esto es correcto? Por favor conteste YES o NO.
vi: Cám ơn anh. Địa chỉ của bạn là “%MESSAGE_BODY%”. Điều này có đúng không? Vui lòng trả lời YES hoặc NO.

# ADDRESS_UPDATED
source: Thank you. Your updated address is: %PHYSICAL_ADDRESS_NEW% You should receive an address confirmation letter in 2-4 weeks. If it doesn’t arrive, or if you have questions, visit https://example.gov/medicaid/.
es: Gracias. Su dirección ha sido actualizada. Tu nueva dirección es: %PHYSICAL_ADDRESS_NEW%
vi: Cám ơn anh. Địa chỉ của bạn đã được cập nhật. Địa chỉ mới của bạn là: %PHYSICAL_ADDRESS_NEW%

# REPROMPT_FOR_ADDRESS
source: Let's try again. Please reply with your updated address.
es: Vamos a intentarlo de nuevo. Por favor responda con su dirección completa.
vi: Hãy thử lại lần nữa. Vui lòng trả lời với địa chỉ đầy đủ của bạn.
